{
  "author": "Unknown",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiBRB50dbOjClOPj-4VPTn7Zk5R9A51bmModPw_6-W-EdyMYkv_PUY0XAfpO7-CP9R3PMN30rosNye1Zuudmk5TewNvY7d-RnDU5P2ZzYRIw3InNfoT2Ehfckm_EcWKxf8x6FJWs0R0wr6juz5-pKa7Y866dU0IhuR5RzaKbiSPYrlAzZ5tZQIOp2j3SdI/w640-h426/ChatGPT%20Image%20May%2017,%202025,%2008_09_24%20PM.png",
  "story": "Five best friends, Dyno, Papun, Lipun, Sonu, and Shreyans - were all part of a fun camping group called OhYaOhYa. They were all busy with life, but one summer, they decided to go camping together.@Dyno was studying for civil service exams and loved taking photos. Papun was a software engineer. Lipun was doing graduation in chemistry. Sonu had a mechanical engineering job. Shreyans was a medical student.@They chose Andhari Mountain for the camping trip. It was very close to the village where Papun and Lipun lived. Both had climbed the mountain many times, but never stayed there at night.@People in their village told scary stories about the mountain. Long ago, when India was ruled by the British, a cruel British officer used to visit that place. One day, a rock fell from the mountain and killed him. Since then, people said his ghost — wearing a red coat and riding a black horse — still haunted the mountain at night. He carried a sword and chased away anyone who disturbed him.@Papun and Lipun warned their friends. But Sonu said, Who cares? Let’s enjoy! Ghosts are just stories. Dyno agreed too. I want to take night-time photos. The view from the mountain is amazing - Dyno said!@So everyone packed their bags, told their families they were going on a picnic, and climbed the mountain early the next morning. It was sunny and clear. They set up their tents, made a campfire, and had a great time.@But after the sun went down, the mood changed.@The forest became very quiet. The wind stopped. The night felt cold and strange.@They sat near the fire, telling stories and jokes.@Then Papun shared the ghost story again. Shreyans got a little scared, but Sonu laughed and said Let the red coat ghost come! I’ll take a selfie with him.@At 11:30 PM, Dyno picked up his camera and said I’ll go a bit up the hill to take some star photos. I won’t take long. He left with his headlamp and camera.@But after 30 minutes… he didn’t come back.@The group got worried. They climbed up the hill, calling his name. Dyno! Where are you?@They found his camera on the ground, still on — but Dyno was missing.@Then they saw something scary: fresh horse footprints in the dirt. There were no horses on the mountain.@Suddenly, they heard galloping in the distance… and a loud scream. It was Dyno’s voice.@Then… silence.@Scared and confused, they rushed back to the camp. The fire was flickering low.@Then, around 2 AM, they heard footsteps around their tents. Heavy boots. A strange neighing sound.@Papun peeked out… and froze.@There stood a tall man in a red British coat, holding a rusty sword, riding a big black horse. His face looked pale and angry. His eyes were glowing red.@The ghost stared at the tents and said in a deep, scary voice: Leave… my mountain.@Papun screamed. They all ran, dragging Shreyans, who had tripped. Behind them, the sound of galloping followed. Trees shook. Branches broke. The ground felt like it was rumbling.@ They kept running until they reached the bottom of the mountain, near the village.@ As the sun began to rise, the ghost disappeared.@But just then, they heard a weak voice from behind a tree. Help…@It was Dyno! He was lying on the ground, dirty and shaken, but alive.@ He said he was taking photos when he saw a red figure appear from the mist. Then he felt a cold hand on his shoulder — and blacked out.@When he woke up, he was lying in the woods, unable to move or shout.@They helped Dyno back to the village. He never forgot what he saw that night.@The friends made a promise: never talk about what happened on Andhari Mountain.@But villagers still say… if you go up there at night… and if you don’t leave in time… You might hear hooves in the dark. And see a ghost in a red coat… Still guarding his mountain.@Thank you. End!"
}
