{
  "author": "Unknown",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjUIh9JW6xpxrJfsZWS-JFqZAbSxMxUcMk7MEQc0fSvXPOLksaDmGfgv11U_VumykFv2em1Ye3crQCY2_4g9gb_z5b4SFV2oZM87PAWW43QD9lHIJ4tm0eWSoiGIwSj7vcIiIzXr4tKGWhEVJygK4co__yeW0TOZLr4ZRJi4Vyqq0nPb3ZS0Aw3-WKOQTw/w640-h476/image.jpg",
  "story": "There are many roads where people love to travel during the day because they’re shortcuts. But at night, no one wants to go there. There’s a road between Mumbai and Nashik — a long, 20 km ghat called Kasara Ghat. The locals don’t believe in ghost stories, but travelers often say that when you drive there at night, you won’t see anyone outside the window — but if you look in your rearview mirror, you’ll see a person running behind your car at the same speed as your car. It’s a haunted place.@Now let’s talk about a true incident that happened with a Mumbai resident named Mohan and his father Kaanji. One day, they had to travel from Mumbai to Nashik. They didn’t know that traveling through Kasara Ghat at night is very risky and scary. It’s a long, lonely, and haunted road.@Mohan’s family lived in Andheri. Their native village was in Nashik, but they hadn’t gone there in years. One day, Kaanji got a phone call from the village. They were having a special religious ceremony and called them urgently. Kaanji asked Mohan to come with him, but Mohan was busy with work and made an excuse. His mother got angry and scolded Mohan to go with his father. Finally, Mohan agreed.@After finishing work, Mohan and Kaanji packed their bags and left in their car at night. The roads were empty and dark. Since there was no traffic, Mohan got a little frustrated, thinking about how tired he was from work and now had to travel at night. Meanwhile, his father was relaxed, listening to old songs.@They kept stopping for bathroom breaks, food, and rest. As they got close to Kasara Ghat, Kaanji fell asleep in the passenger seat. It was dark, and the roads were completely empty. Mohan felt like he was the only one on that entire stretch of road. After a while, Mohan started feeling sleepy too — because it’s natural when your passenger is asleep, and it’s midnight.@Since the road was empty, he thought it was safe to drive faster. Suddenly, a woman appeared in front of the car, and Mohan accidentally hit her. He immediately stopped the car, and Kaanji woke up asking what happened. Mohan told him about the accident and wanted to check if the woman was okay.@But Kaanji stopped him and said, “No matter what, don’t get out of the car here. This is Kasara Ghat — the living and the dead exist together here. There are many spirits wandering around. Some people say a woman comes in front of your car at night, pretending to get hit. When you get out to help, she drags you into a valley and kills you.”@Mohan was shocked but still looked at his rearview mirror. He saw blood-covered hands on the car. Ignoring his father’s words, Mohan stepped out of the car. Kaanji also got down, and both went to the back of the car — but there was no one there.@They both looked at each other in fear. Mohan said, “Dad, I saw her in the mirror! Her hands were full of blood!”@At that moment, Kaanji’s warning echoed in Mohan’s head: Never stop your car or get out in Kasara Ghat, no matter what. But Mohan had already done both.@They quickly got back into the car. But when Mohan went near the car, he noticed someone was sitting on the back seat. Both sat inside, scared, and drove off.@While driving, Mohan kept thinking about what had happened. Suddenly, they felt like the car hit something again — but this time, there was no one in front, no one behind, and no marks on the car. Mohan stopped, checked the tires — everything was fine.@Then, nearby, Mohan saw a woman sitting by the roadside, crying. She was wearing a white saree. Mohan remembered — this was the same woman he hit earlier. But how was she here again?@He started walking towards her. Before he could go closer, Kaanji shouted, “Get back in the car right now!”@Hearing this, the woman raised her head — but there was no head, only a body covered in a white saree. Both father and son screamed in fear, jumped into the car, and drove as fast as they could.@Finally, they reached a small roadside food stall (dhaba) after crossing Kasara Ghat. They were sweating heavily and looked terrified.@The man at the stall asked them what happened. Mohan told him about the headless woman and how she kept appearing on the road.@The stall owner said, “Sir, that’s the famous ghost here. Many people have seen her. But you’re safe now — this dhaba is beyond Kasara Ghat.”@Hearing this, both felt a little relieved.@The man then offered them something to drink. They refused but accepted water. As they drank the water, the stall owner picked up one more glass and walked towards their car.@Mohan asked, “Where are you taking that?”The man replied, “Sir, I’m taking it for the lady sitting in your back seat.”@Hearing this, Mohan and Kaanji dropped their glasses and ran away from there as fast as they could."
}
