{
  "author": "Unknown",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhjKLAkOseoM_-ujbarWNurK499IoLbn1djEOD7PEqucgumk0KAp05MmUZH9UcMs43QXVnkWeACDFSGdGYT78sJTHsCCgQtcW0ZLNyvwECstOl1U1_CEpSHObvHefhMkgE4VwjR11Mmy7Gb1IFwX8PEgeawLNkXxciIWIeTL99OCzhpmyFrXfUcqxpJBpQ/w640-h426/Gemini_Generated_Image_nysk9knysk9knysk.jpg",
  "story": "Five college friends – Aarav, Nikita, Sameer, Zoya, and Raghav – planned a fun weekend trip to a high, quiet mountain. They wanted to see the amazing night sky from there. Raghav, who made videos for his YouTube channel, was recording everything.@Their plan was to hike during the day, set up tents in the evening, have a bonfire, eat barbecue and Maggi noodles, and look at the stars with a telescope. They didn't realize it was a new moon night, meaning there would be no moon. Still, the stars looked bright and beautiful. They had a great time, setting up camp, singing songs with a guitar around the fire, and enjoying their food. It was a perfect adventurous night.@Around 2:30 in the morning, everyone got tired and went to sleep. But Raghav stayed awake to edit his videos. While he was looking at the footage, he got really scared. He saw something strange. In the videos, from the time they were halfway up the mountain, a woman was following them. Nobody had seen her, but she was clear in the camera. She was wearing white clothes, her hair was open, her face was completely white, her eyes didn't blink, and her lips looked sewn shut. She had no expression on her face, like a dead person. She was in every video clip. When they were looking at the stars, when they were laughing, when they were having barbecue, when they were eating Maggi. She was always standing far away, just watching them. In the last video, she was standing right next to their tent.@Raghav's heart beat fast. His mouth felt dry with fear. Was she still near the tent? He carefully opened the tent zipper, took out his phone, and quickly recorded a short video outside. Then he put his phone back in his pocket. When he watched the video he just made, he screamed. The woman was standing right in front of the tent. He could see her clearly in the phone camera, but no one could see her with their own eyes.@Hearing his scream, everyone woke up. Raghav was shaking and couldn't speak. Aarav thought it might be a wild animal, so he opened the tent and went outside. Then they heard another scream, and Aarav didn't come back. Now the remaining three friends were terrified inside the tent, trembling.@Raghav somehow managed to calm down and showed the video to Nikita, Sameer, and Zoya. They were all shocked. They huddled inside the tent, scared. Suddenly, they heard noises on top of the tent, like someone scratching with their nails. Then, one by one, their mobile phones stopped working. Only Raghav's camera was still on. He turned it on and started recording outside.@The camera showed the woman slowly walking around their tent. She wasn't walking straight. It looked like she was dragging a body with broken bones. Her feet were turned backward, as if bent from her knees. Her hair covered her face, but her white eyes were visible through it, staring straight at the camera. Then, the camera showed severed fingers of a boy hanging from her neck. They were Aarav's.@Zoya screamed, 'We have to get out of here!' But they couldn't see the path, and going outside the tent felt like certain death. Sameer had an idea. He had a small, old book of Hanuman Chalisa, a religious hymn, which he always carried. Together, they started reading it loudly. Just then, the tent started shaking, as if someone was lifting it. It went up in the air about three feet. Raghav pointed the camera down and saw the woman looking up from under the tent. Now, blood was dripping from her eyes, and instead of a voice, she was making an animal-like growling sound. Then there was a loud bang, and everything went black.@When Raghav woke up, the sun was shining. He was alone. Without thinking, he started running down the mountain. The path was long, his knees got scraped, and his hands kept shaking. As soon as he reached the village, he fainted. When he woke up again, he was in a hospital. He told the police everything and showed them the video. But the camera's memory card was empty.@The police searched the mountain but couldn't find any trace of his friends. They only found one thing: an old, torn photograph of the same woman standing in front of a tent that looked old and burnt, not new like theirs.@People say that the woman had come to the same mountain for an adventure with her friends a long time ago. But her friends betrayed her and burned her alive there. Now, every new moon night, she comes back, looking for people who come to the mountain for adventure, just like she did.@Raghav is still alive today, but he has never spoken since that night. He just keeps muttering the same words every night: 'She's still there, near the tent.'@So, if you are planning an adventurous mountain camping trip, make sure to check the date. Don't go on a new moon night, because she is still there."
}
