{
  "author": "Unknown",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgpedfFGTHoNxYhSIeGfM3xIIroNYkqvdd-cF05al8xanHRvrSEFFU3T6LLeu8Rn3wgtJQJN8S_JokmweitFPam3EfyWPqGBdLM8OMTCf32SMprX-FN_l8d8JHGHPVNpwM5CvZHarcPT6mloADl6F5aNbs32-QB9nF7IDOwMmM7Xv4JFkky6OZoOIv5sI0/w640-h466/Gemini_Generated_Image_7fbv5l7fbv5l7fbv.jpg",
  "story": "Based on a real incident. This is the story of a young man named Ratan. He had just finished his studies to become a doctor in a city called Kathmandu. Before starting his work, he wanted to visit his grandpa in his village, Baniatar. It wasn't very far from Kathmandu, only a short drive.@Ratan took his three best friends with him. They had a fun time in the village with Ratan's grandpa for a few days. When it was time to go back, Grandpa gave them a very important rule: "Don't go through the Betini forest after it gets dark, especially after 10 o'clock at night!"@Ratan's friends didn't really know why. They asked, "Is it dangerous?" Grandpa said, "Yes, there are some things there. Trust me, you don't want to see them."@But Ratan's friends were a little bit naughty and curious. Grandpa told them that people called Jhakri lived in that forest, people who could talk to spirits. Maybe Grandpa shouldn't have said that! The friends told him, "Don't worry, Grandpa! We'll leave by 7 in the evening and be in Kathmandu by 9!"@Usually, it took only two hours to drive from Ratan's village to Kathmandu. They left at 7 PM, but instead of going straight to Kathmandu, Ratan's friends had a sneaky plan. They told Ratan, "Let's go see what your grandpa was talking about! We don't believe in ghosts until we see them!" So, they all convinced Ratan to go through the forest after 10 PM.@They drove a little way and reached a place called Gangate. From there, one road went to Kathmandu, and another went to a town called Trishuli. Trishuli was only a short 15-minute drive from Ratan's village and had an old temple. So, they went to the temple and waited there until 10 o'clock at night!@Finally, when it was 10 PM, Ratan and his friends got back in their car and started driving from Trishuli towards Kathmandu. Ratan was in the front, and his friend Sameer was driving. The car windows were open. After about 15-20 minutes, they entered the Betini forest. This 7-kilometer stretch of forest was going to be a very scary adventure for them.@As soon as they drove about 100 meters into the forest, it suddenly became very cold! The temperature dropped a lot. There were tall, thick trees on both sides of the road, and a chilly wind blew through the car. They decided to close the windows because it was too cold.@They drove on slowly with the windows closed. After driving for maybe half a kilometer, they all heard the sound of little kids crying. It sounded like it was coming from deep inside the dark forest. As they drove further, the crying got louder and louder.@Ratan said, "See! Grandpa was right! We shouldn't have come this way at this time!" But Sameer said, "Don't worry! We are all together. We'll be okay."@They were driving through a valley. Suddenly, as Sameer turned the car, they saw an old woman sitting right in the middle of the road! She was waving her hand, telling them to stop. She was about 50-60 meters away. The friends inside the car got very scared. Ratan said, "Whatever happens, Sameer, don't stop the car! Just keep driving!"@But Sameer said, "She's sitting on the road! I can't just hit her and drive away!" The friends in the back said, "Who's going to see? Just drive over her and let's go!" But Sameer's heart didn't feel right about that. He slowed down the car as they got closer to the woman.@When they were just about 10 meters away from her, they saw something very creepy! There were many dead bodies lying on both sides of the road! Seven or eight children were sitting near the bodies, crying loudly. And there were about 10-15 other people picking up the dead bodies and putting them on pieces of cloth. But when Ratan and his friends looked at the faces of these people, they got super scared! Their faces looked all messed up. Some had no eyes, some had torn cheeks, and some had their heads cut open!@Seeing all this, Ratan shouted, "Sameer, drive faster! Go, go!" But the old woman was still sitting on the road in front of them. Sameer wasn't moving the car forward. Then the friends yelled, "Quickly, reverse the car!"@So, Sameer put the car in reverse and started backing up. As Sameer was backing up, the people who were loading the dead bodies saw their car. Two of them picked up burning sticks like torches and started running after them! Ratan and his friends were all shouting at Sameer, "Go! Get out of here quickly!"@It was very dark in the valley behind them. Sameer couldn't see where he was going. He was worried that they might fall off a cliff while reversing. So, Sameer decided to go forward. He thought he would have to drive over the old woman. He pressed the gas pedal hard and drove very fast towards her. Just as the car was about to hit the woman, Sameer closed his eyes tightly.@After a few seconds, he opened his eyes. His friends told him, "Dude! That woman disappeared! As soon as the car got close, we saw that there was no one there!" Now they were all very, very scared. They wanted to get out of that spooky forest as fast as they could and reach Kathmandu. Sameer drove very fast, and they all kept saying that they had made a big mistake by coming this way and that they should have listened to Grandpa.@While they were talking, Sameer suddenly saw a bus coming towards them very fast! Before Sameer could do anything, the bus crashed right into their car! Sameer slammed on the brakes very hard. His head hit the steering wheel, and Ratan, who was in the front, hit his head on the dashboard, and his nose started bleeding. Their hearts were beating super fast!@When they recovered a little from the shock, they looked up at the road in front. Guess what? There was no bus! Their car was standing in the middle of the dark forest on the Pasang Lhamu Highway. Ratan and his friends were sweating a lot. The car windows were still closed. They all decided to get out of the car together, take a deep breath, and then drive on.@Sameer and his friend Sanjay got out from the right side, and Ratan and his friend Kripa got out from the left. Now, listen to what happened next! They were all standing outside the car, looking back at the road they had just come from. Suddenly, Ratan heard his grandpa's voice right near his ear! It was just calling his name, "Ratan, Ratan, Ratan." He didn't turn around. He turned his neck and told his friend Kripa, "Kripa, this is happening! I can hear Grandpa's voice!"@Kripa grabbed Ratan's hand very tightly and said, "Ratan, don't answer! We are talking very quietly. Ratan, don't answer and don't look back right now!" Ratan was sweating like crazy. His friends Sameer and Sanjay looked at him and asked, "Ratan, what's wrong? Why are you sweating so much? There's a nice breeze right now." Ratan told Sameer, "Get in the car! Get in quickly!" They didn't ask too many questions. Sameer and Sanjay got back in the car, and then Ratan and Kripa also got in. Ratan said, "Let's go! Quickly!"@After driving a little further, Ratan told them that he had just heard his grandpa's voice again. They all stared at Ratan with wide eyes. They were worried that maybe something spooky had taken over Ratan in that place.@Sameer slowly drove the car forward. They had probably gone about one and a half kilometers when suddenly a man, who looked about 50 or 60 years old, stood right in front of their car on the road and waved his hand, asking them to stop. Sameer and Ratan and the others saw that he looked like a normal person. They thought maybe he was also stuck in the forest like them. So, they stopped the car near the man.@Ratan rolled down his window and asked, "What happened? Why are you walking here at this time?" The man said, "My older brother is sick in a hospital in Kathmandu. I need to go see him. Can you please give me a ride?" All the friends agreed that they should help him. The man sat in the back seat. Ratan and his friends told him about all the scary things that had just happened to them and how frightened they were.@Then the man told them that many years ago, a bus had crashed in that Betini forest area. The bus was full of people, and no one survived. Because no one came to help them in time, they had suffered a lot before they died in the forest. He said that their spirits still wandered there at night.@Then Ratan told him that he had just heard his grandpa's voice when they had stepped out of the car. The man said, "It's a good thing you didn't turn back. If you had, none of you would have survived in this place."@Sameer quietly drove the car for about an hour and a half and finally reached Kathmandu. As they entered the city, they went into a neighborhood, and the man said, "My house is here. You can stop the car here. I will go to the hospital tomorrow morning because it's very late now." Saying this, the man opened the car door, smiled at them, and walked towards a house. They all watched him go towards the house, and as soon as he reached the gate, he turned towards them and then... he disappeared right in front of their eyes!@All the friends looked at each other, completely shocked. "What just happened?" Ratan and his friends got out of the car and went to the house. They knocked on the door. An old woman came out. They were looking inside the house to see where the man had gone. Ratan told the old woman everything, that an uncle had just been with them and had disappeared right in front of the house.@Then the old woman invited them inside and made them sit on the sofa. She told them that the man who had been in their car was her younger son. He had died four years ago in that same forest. At that time, her older son was sick in the hospital, and her younger son was traveling through the forest to Kathmandu to see him. But he had an accident and died there.@Then the old woman said that her younger son's spirit often helped people there. She said that her son had saved all of their lives. Otherwise, the other angry spirits in that forest wouldn't have let them pass through alive. The old woman also told them that during the Nepal Civil War, from 1996 to 2006, many terrible things had happened in the Betini forest. The bad Maoist people had killed many people there, and their sad spirits also wandered on the forest road at night.@Hearing all this, Rohan (oops, I mean Ratan!) held his ears and said that his grandpa had told them not to cross after 10 PM. They hadn't listened to him. But they would never make that mistake again. And then Ratan and his friends finally reached their homes safely in Kathmandu."
}
