{
  "author": "Unknown",
  "image": "https://images.unsplash.com/photo-1628188256524-31ceb39b461f?fm=jpg&q=60&w=3000&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTh8fHNjYXJ5JTIwcm9hZHxlbnwwfHwwfHx8MA%3D%3D",
  "story": "This happened when I was a teenager, on a cold November night. We had guests over for dinner, and after dessert, they left. A few minutes later, my mom noticed my father's friend had forgotten his phone and power bank. She called his wife, and they said they weren't far and would return soon. But my dad told them to wait - he'd send me instead.@He told me to take my bicycle, but I didn't. I just grabbed the phone and power bank and left on foot. Typical teenage thinking - I believed I knew better and decided to take a shortcut through a quiet lane I was familiar with. Most of the houses there were locked, and the streetlights were either flickering or completely out.@The moment I entered that lane, something felt... Wrong. The silence was too heavy, the darkness too thick. I felt a chill run down my spine. Suddenly, I got scared - really scared. I started running with the phone and power bank in hand, just wanting to get out of there.@I could see the end of the lane and my dad's friend waiting there. But just when I thought I was safe - something grabbed my leg.@I fell hard on the road, scraping both knees. At first, I thought I had tripped. But when I tried to get up, I couldn't. The grip was still there. Tight. Cold. Invisible.@There was nothing around me - no rope, no object, no one. Just that unseen hand holding me down. I panicked and pushed myself, trying to crawl. Then I heard someone call my name - it was my dad's friend, running toward me.@As he reached me, the grip vanished.@He helped me up and brought me home. My knees were bleeding, and I was shaken. I told my parents, but they brushed it off, said I must've imagined it out of fear.@That night, I couldn't sleep.@My legs were aching. But finally, I slept... And time passed.@Time passed. I made some new friends, and one day, in a random conversation, I learned something chilling - the history of the very area I used to live in.@The lane I ran through that night... It wasn't just old. It was known for something darker.@But that's a story for another time. And no, I don't live there anymore. I moved out."
}
